robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/utils/stm32i2c.c
/*
 * Copyright (C) 2012 iCub Facility - Istituto Italiano di Tecnologia
 * Author:  Marco Accame
 * email:   marco.accame@iit.it
 * website: www.robotcub.org
 * Permission is granted to copy, distribute, and/or modify this program
 * under the terms of the GNU General Public License, version 2 or any
 * later version published by the Free Software Foundation.
 *
 * A copy of the license can be found at
 * http://www.robotcub.org/icub/license/gpl.txt
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General
 * Public License for more details
*/


/* @file       stm32i2c.c
	@brief      This file implements init / deinit of i2c using stm32 apis.
	@author     marco.accame@iit.it
    @date       09/24/2012
**/

// - modules to be built: contains the HAL_USE_* macros ---------------------------------------------------------------
//#include "hal_brdcfg_modules.h"

//#ifdef HAL_USE_I2C4HAL

// --------------------------------------------------------------------------------------------------------------------
// - external dependencies
// --------------------------------------------------------------------------------------------------------------------

#include "stdlib.h"
#include "string.h"
#include "hal_stm32xx_include.h"

//#include "hal_brdcfg.h"
 
// --------------------------------------------------------------------------------------------------------------------
// - declaration of extern public interface
// --------------------------------------------------------------------------------------------------------------------

#include "stm32i2c.h"


// --------------------------------------------------------------------------------------------------------------------
// - declaration of extern hidden interface 

//#include "stm32i2c_hid.h"

// --------------------------------------------------------------------------------------------------------------------
// - #define with internal scope
// --------------------------------------------------------------------------------------------------------------------



// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of extern variables, but better using _get(), _set() 
// --------------------------------------------------------------------------------------------------------------------

// extern const stm32i2c_cfg_t stm32i2c_cfg_default = 
// { 
//     0
// };



// --------------------------------------------------------------------------------------------------------------------
// - typedef with internal scope
// --------------------------------------------------------------------------------------------------------------------



typedef struct
{
    uint32_t    clock;
    uint32_t    gpio_remap;
    uint32_t    gpio_remap_clock;
} stm32i2c_i2cx_cfg_t;

typedef struct
{
    uint32_t            clock;
    GPIO_TypeDef*       port;
    uint16_t            pinnum;
    GPIO_InitTypeDef    pin;
} stm32i2c_i2c_gpio_cfg_t;

typedef struct
{
    uint8_t                     initted[3]; // i2c1, i2c2, i2c3
    stm32i2c_cfg_t              cfg;
    I2C_TypeDef*                i2cx;
    stm32i2c_i2cx_cfg_t         i2cx_cfg;
    stm32i2c_i2c_gpio_cfg_t     i2c_gpio_scl;
    stm32i2c_i2c_gpio_cfg_t     i2c_gpio_sda;
} stm32i2c_generic_container_t;



// --------------------------------------------------------------------------------------------------------------------
// - declaration of static functions
// --------------------------------------------------------------------------------------------------------------------

static stm32i2c_result_t s_stm32i2c_i2c_common_init(const stm32i2c_cfg_t* i2ccfg);
static stm32i2c_result_t s_stm32i2c_i2c_common_deinit(const stm32i2c_cfg_t* i2ccfg);


static stm32i2c_result_t s_stm32i2c_i2c_prepare_data(const stm32i2c_cfg_t* i2ccfg, const uint8_t usefloatingpins);

static void s_stm32i2c_i2c_gpio_init(void);
static void s_stm32i2c_i2c_enable(void);


static void s_stm32i2c_i2c_disable(void);
static void s_stm32i2c_i2c_gpio_deinit(void);

//static stm32i2c_result_t s_stm32i2c_i2c_waitdevicestandbystate(uint8_t port, uint8_t devaddr);



// --------------------------------------------------------------------------------------------------------------------
// - definition (and initialisation) of static variables
// --------------------------------------------------------------------------------------------------------------------


static stm32i2c_generic_container_t s_stm32i2c_generics = 
{
    .initted                = {0, 0, 0},
    .cfg                    = 
    {
        .speed                          = 0,
        .scl                            = 
        {
            .port                           = stm32i2c_gpio_portNONE,
            .pin                            = stm32i2c_gpio_pinNONE
        },
        .sda                            =
        {
            .port                           = stm32i2c_gpio_portNONE,
            .pin                            = stm32i2c_gpio_pinNONE        
        }   
    },
    .i2cx                   = NULL,
    .i2cx_cfg               =
    {
        .clock                          = 0,
        .gpio_remap                     = 0,
        .gpio_remap_clock               = 0
    }
};


static const I2C_InitTypeDef   s_stm32i2c_i2c_cfg       =
{
    .I2C_Mode                   = I2C_Mode_I2C,
    .I2C_DutyCycle              = I2C_DutyCycle_2,
    .I2C_OwnAddress1            = 0,
    .I2C_Ack                    = I2C_Ack_Enable,
    .I2C_AcknowledgedAddress    = I2C_AcknowledgedAddress_7bit,
    .I2C_ClockSpeed             = 400000            // PARAMETER
};


#if     defined(USE_STM32F1)

static const uint8_t s_stm32i2c_maxports                    = 2;

static I2C_TypeDef* const       s_stm32i2c_i2cx_port[3]               = {I2C1, I2C2, NULL};
static const uint32_t           s_stm32i2c_i2cx_clock[3]              = {RCC_APB1Periph_I2C1, RCC_APB1Periph_I2C2, 0};  
static const uint32_t           s_stm32i2c_i2cx_gpio_remap_clock[3]   = {RCC_APB2Periph_AFIO, 1, 1}; // 1 means that i dont know if it is correct     
static const uint32_t           s_stm32i2c_i2cx_gpio_remap[3]         = {GPIO_Remap_I2C1, GPIO_Remap_I2C1, GPIO_Remap_I2C1};


static const uint32_t s_stm32i2c_i2c_gpio_thegpioclocks[]    = { RCC_APB2Periph_GPIOA, RCC_APB2Periph_GPIOB, RCC_APB2Periph_GPIOC, 
                                                                RCC_APB2Periph_GPIOD, RCC_APB2Periph_GPIOE, RCC_APB2Periph_GPIOF, 
                                                                RCC_APB2Periph_GPIOG };  
static GPIO_TypeDef* const s_stm32i2c_i2c_gpio_thegpioports[]= { GPIOA, GPIOB, GPIOC, 
                                                                GPIOD, GPIOE, GPIOF, 
                                                                GPIOG };  
static const uint8_t  s_stm32i2c_i2c_gpio_thepinnums[]       = { 0,  1,  2,  3,
                                                                4,  5,  6,  7,
                                                                8,  9,  10, 11,
                                                                12, 13, 14, 15 }; 
static const uint16_t  s_stm32i2c_i2c_gpio_thepins[]         = { GPIO_Pin_0,  GPIO_Pin_1,  GPIO_Pin_2,  GPIO_Pin_3,
                                                                GPIO_Pin_4,  GPIO_Pin_5,  GPIO_Pin_6,  GPIO_Pin_7,
                                                                GPIO_Pin_8,  GPIO_Pin_9,  GPIO_Pin_10, GPIO_Pin_11,
                                                                GPIO_Pin_12, GPIO_Pin_13, GPIO_Pin_14, GPIO_Pin_15 }; 
                                                                
 
static const GPIO_InitTypeDef  s_stm32i2c_i2c_gpio_sxx_pin  =
{
    .GPIO_Pin       = GPIO_Pin_All,
    .GPIO_Speed     = GPIO_Speed_50MHz,
    .GPIO_Mode      = GPIO_Mode_AF_OD,
}; 

