robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/utils/stm32i2c.c
static const GPIO_InitTypeDef  s_stm32i2c_i2c_gpio_sxx_floatpin  =
{
    .GPIO_Pin       = GPIO_Pin_All,
    .GPIO_Speed     = GPIO_Speed_2MHz,
    .GPIO_Mode      = GPIO_Mode_IN_FLOATING,
}; 
    
#elif   defined(USE_STM32F4)

static const uint8_t s_stm32i2c_maxports                    = 3;



static  I2C_TypeDef* const      s_stm32i2c_i2cx_port[3]               = {I2C1, I2C2, I2C3};
static const uint32_t           s_stm32i2c_i2cx_clock[3]              = {RCC_APB1Periph_I2C1, RCC_APB1Periph_I2C2, RCC_APB1Periph_I2C3};  
static const uint32_t           s_stm32i2c_i2cx_gpio_remap_clock[3]   = {RCC_APB2Periph_SYSCFG, 1, 1}; // 1 means that i dont know if it is correct     
static const uint32_t           s_stm32i2c_i2cx_gpio_remap[3]         = {GPIO_AF_I2C1, GPIO_AF_I2C2, GPIO_AF_I2C3};


static const uint32_t s_stm32i2c_i2c_gpio_thegpioclocks[]    = { RCC_AHB1Periph_GPIOA, RCC_AHB1Periph_GPIOB, RCC_AHB1Periph_GPIOC, 
                                                                RCC_AHB1Periph_GPIOD, RCC_AHB1Periph_GPIOE, RCC_AHB1Periph_GPIOF, 
                                                                RCC_AHB1Periph_GPIOG, RCC_AHB1Periph_GPIOH, RCC_AHB1Periph_GPIOI };  
static GPIO_TypeDef* const s_stm32i2c_i2c_gpio_thegpioports[]= { GPIOA, GPIOB, GPIOC, 
                                                                GPIOD, GPIOE, GPIOF, 
                                                                GPIOG, GPIOH, GPIOI };  
static const uint8_t  s_stm32i2c_i2c_gpio_thepinnums[]       = { GPIO_PinSource0,  GPIO_PinSource1,  GPIO_PinSource2,  GPIO_PinSource3,
                                                                GPIO_PinSource4,  GPIO_PinSource5,  GPIO_PinSource6,  GPIO_PinSource7,
                                                                GPIO_PinSource8,  GPIO_PinSource9,  GPIO_PinSource10, GPIO_PinSource11,
                                                                GPIO_PinSource12, GPIO_PinSource13, GPIO_PinSource14, GPIO_PinSource15 }; 
static const uint16_t  s_stm32i2c_i2c_gpio_thepins[]         = { GPIO_Pin_0,  GPIO_Pin_1,  GPIO_Pin_2,  GPIO_Pin_3,
                                                                GPIO_Pin_4,  GPIO_Pin_5,  GPIO_Pin_6,  GPIO_Pin_7,
                                                                GPIO_Pin_8,  GPIO_Pin_9,  GPIO_Pin_10, GPIO_Pin_11,
                                                                GPIO_Pin_12, GPIO_Pin_13, GPIO_Pin_14, GPIO_Pin_15 }; 
                                                                
 
static const GPIO_InitTypeDef  s_stm32i2c_i2c_gpio_sxx_pin  =
{
    .GPIO_Pin       = GPIO_Pin_All,
    .GPIO_Mode      = GPIO_Mode_AF,
    .GPIO_Speed     = GPIO_Speed_50MHz,
    .GPIO_OType     = GPIO_OType_OD,
    .GPIO_PuPd      = GPIO_PuPd_NOPULL
}; 

static const GPIO_InitTypeDef  s_stm32i2c_i2c_gpio_sxx_floatpin  =
{
    .GPIO_Pin       = GPIO_Pin_All,
    .GPIO_Mode      = GPIO_Mode_IN,
    .GPIO_Speed     = GPIO_Speed_2MHz,
    .GPIO_OType     = GPIO_OType_PP,
    .GPIO_PuPd      = GPIO_PuPd_NOPULL
}; 

#endif

// --------------------------------------------------------------------------------------------------------------------
// - definition of extern public functions
// --------------------------------------------------------------------------------------------------------------------

extern stm32i2c_result_t stm32i2c_init(uint8_t port, const stm32i2c_cfg_t *cfg)
{
    stm32i2c_result_t res = stm32i2c_res_NOK;
    
    if((0 == port) || (port > s_stm32i2c_maxports) || (NULL == cfg))
    {
        return(stm32i2c_res_NOK);
    }
 
    
    if((100000 != cfg->speed) && (200000 != cfg->speed) && (400000 != cfg->speed))
    {
        return(stm32i2c_res_NOK);
    }
    
    if((stm32i2c_gpio_portNONE == cfg->scl.port) || (stm32i2c_gpio_pinNONE == cfg->scl.pin) || (stm32i2c_gpio_portNONE == cfg->sda.port) || (stm32i2c_gpio_pinNONE == cfg->sda.pin))
    {
        return(stm32i2c_res_NOK);
    }
      
    
    // do other controls over cfg ....
          
    if(1 == s_stm32i2c_generics.initted[port-1])
    {
        return(stm32i2c_res_NOK);
    }
    
    
    // ok, cfg is good and can initialise... i copy it into ...
    
    memcpy(&s_stm32i2c_generics.cfg, cfg, sizeof(stm32i2c_cfg_t));
    
    
    // init some data
    s_stm32i2c_generics.i2cx                         = (I2C_TypeDef*)s_stm32i2c_i2cx_port[port-1];
    s_stm32i2c_generics.i2cx_cfg.clock               = s_stm32i2c_i2cx_clock[port-1];
    s_stm32i2c_generics.i2cx_cfg.gpio_remap          = s_stm32i2c_i2cx_gpio_remap[port-1];
    s_stm32i2c_generics.i2cx_cfg.gpio_remap_clock    = s_stm32i2c_i2cx_gpio_remap_clock[port-1];

    
    // init the generics according to the device
    
    res = s_stm32i2c_i2c_common_init(&s_stm32i2c_generics.cfg);
    
    if(stm32i2c_res_NOK == res)
    {
        s_stm32i2c_generics.initted[port]  = 0;
        return(stm32i2c_res_NOK);
    }
    else
    {
        s_stm32i2c_generics.initted[port]  = 1;   
    }        
        
    return(stm32i2c_res_OK);
}


extern stm32i2c_result_t stm32i2c_deinit(uint8_t port, const stm32i2c_cfg_t *cfg)
{
    if((0 == port) || (port > s_stm32i2c_maxports) || (NULL == cfg))
    {
        return(stm32i2c_res_NOK);
    }
 
    
    if((100000 != cfg->speed) && (200000 != cfg->speed) && (400000 != cfg->speed))
    {
        return(stm32i2c_res_NOK);
    }
    
    if((stm32i2c_gpio_portNONE == cfg->scl.port) || (stm32i2c_gpio_pinNONE == cfg->scl.pin) || (stm32i2c_gpio_portNONE == cfg->sda.port) || (stm32i2c_gpio_pinNONE == cfg->sda.pin))
    {
        return(stm32i2c_res_NOK);
    }


    // init some data
    s_stm32i2c_generics.i2cx                         = (I2C_TypeDef*)s_stm32i2c_i2cx_port[port-1];
    s_stm32i2c_generics.i2cx_cfg.clock               = s_stm32i2c_i2cx_clock[port-1];
    s_stm32i2c_generics.i2cx_cfg.gpio_remap          = s_stm32i2c_i2cx_gpio_remap[port-1];
    s_stm32i2c_generics.i2cx_cfg.gpio_remap_clock    = s_stm32i2c_i2cx_gpio_remap_clock[port-1];
    
    s_stm32i2c_i2c_common_deinit(cfg);

    
    return(stm32i2c_res_OK);
}




