robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/utils/stm32i2c.c
    /*  Keep looping till the slave acknowledge his address or maximum number 
        of trials is reached (this number is defined by stm32ee_hid_ackaddress_maxtrials define
        in stm324xg_eval_i2c_ee.h file) */
    while(1)
    {
        /*!< Send START condition */
        I2C_GenerateSTART(i2cx, ENABLE);

        /*!< Test on EV5 and clear it */
//        s_stm32ee_generics.timeout = stm32ee_hid_timeout_flag;
        while(!I2C_CheckEvent(i2cx, I2C_EVENT_MASTER_MODE_SELECT))
        {
//            if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
        }    

        /*!< Send EEPROM address for write */
        I2C_Send7bitAddress(i2cx, devaddr, I2C_Direction_Transmitter);

        /* Wait for ADDR flag to be set (Slave acknowledged his address) */
//        s_stm32ee_generics.timeout = stm32ee_hid_timeout_long;
        do
        {     
            /* Get the current value of the SR1 register */
            tmpSR1 = (i2cx)->SR1;

            /* Update the timeout value and exit if it reach 0 */
//            if((s_stm32ee_generics.timeout--) == 0) return s_stm32ee_timeoutexpired();
        }
        /* Keep looping till the Address is acknowledged or the AF flag is 
        set (address not acknowledged at time) */
        while((tmpSR1 & (I2C_SR1_ADDR | I2C_SR1_AF)) == 0);

        /* Check if the ADDR flag has been set */
        if (tmpSR1 & I2C_SR1_ADDR)
        {
            /* Clear ADDR Flag by reading SR1 then SR2 registers (SR1 have already 
            been read) */
            (void)(i2cx)->SR2;

            /*!< STOP condition */    
            I2C_GenerateSTOP(i2cx, ENABLE);

            /* Exit the function */
            return stm32i2c_res_OK;
        }
        else
        {
            /*!< Clear AF flag */
            I2C_ClearFlag(i2cx, I2C_FLAG_AF);                  
        }

//        /* Check if the maximum allowed number of trials has bee reached */
//        if (sEETrials++ == stm32ee_hid_ackaddress_maxtrials)
//        {
//            /* If the maximum number of trials has been reached, exit the function */
//            return s_stm32ee_timeoutexpired();
//        }
    }
}



// --------------------------------------------------------------------------------------------------------------------
// - definition of extern hidden functions 
// --------------------------------------------------------------------------------------------------------------------


// ---- isr of the module: begin ----
// empty-section
// ---- isr of the module: end ------


//extern uint32_t stm32i2c_hid_myfunction(void)
//{
//}



// --------------------------------------------------------------------------------------------------------------------
// - definition of static functions 
// --------------------------------------------------------------------------------------------------------------------

//static uint32_t s_stm32i2c_dosomething(void)
//{
//    return(0x12345678);
//}

    
    

static void s_stm32i2c_i2c_software_reset(void)
{
    // implementare la sequenza di sw reset
    
    // forse puo' essere utile usare I2C_GetFlagStatus(I2Cx, I2C_FLAG_BUSY) per verificare qsa.
    // vedi: https://my.st.com/public/STe2ecommunities/mcu/Lists/cortex_mx_stm32/Flat.aspx?RootFolder=%2Fpublic%2FSTe2ecommunities%2Fmcu%2FLists%2Fcortex_mx_stm32%2FI2C%20Unable%20to%20receive%20start%20state%20%28EV5%29&FolderCTID=0x01200200770978C69A1141439FE559EB459D7580009C4E14902C3CDE46A77F0FFD06506F5B&currentviews=2461
    
    
}

static stm32i2c_result_t s_stm32i2c_i2c_prepare_data(const stm32i2c_cfg_t* i2ccfg, const uint8_t usefloatingpins)
{

    const GPIO_InitTypeDef* pin = NULL;
    
    s_stm32i2c_generics.i2c_gpio_scl.clock   = s_stm32i2c_i2c_gpio_thegpioclocks[s_stm32i2c_generics.cfg.scl.port];
    s_stm32i2c_generics.i2c_gpio_scl.port    = (GPIO_TypeDef*)s_stm32i2c_i2c_gpio_thegpioports[s_stm32i2c_generics.cfg.scl.port];
    s_stm32i2c_generics.i2c_gpio_scl.pinnum  = s_stm32i2c_i2c_gpio_thepinnums[s_stm32i2c_generics.cfg.scl.pin];
    pin = (0 == usefloatingpins) ? (&s_stm32i2c_i2c_gpio_sxx_pin) : (&s_stm32i2c_i2c_gpio_sxx_floatpin);
    memcpy(&s_stm32i2c_generics.i2c_gpio_scl.pin, pin, sizeof(GPIO_InitTypeDef));
    s_stm32i2c_generics.i2c_gpio_scl.pin.GPIO_Pin = s_stm32i2c_i2c_gpio_thepins[s_stm32i2c_generics.cfg.scl.pin];
        
    s_stm32i2c_generics.i2c_gpio_sda.clock   = s_stm32i2c_i2c_gpio_thegpioclocks[s_stm32i2c_generics.cfg.sda.port];
    s_stm32i2c_generics.i2c_gpio_sda.port    = (GPIO_TypeDef*)s_stm32i2c_i2c_gpio_thegpioports[s_stm32i2c_generics.cfg.sda.port];
    s_stm32i2c_generics.i2c_gpio_sda.pinnum  = s_stm32i2c_i2c_gpio_thepinnums[s_stm32i2c_generics.cfg.sda.pin];
    pin = (0 == usefloatingpins) ? (&s_stm32i2c_i2c_gpio_sxx_pin) : (&s_stm32i2c_i2c_gpio_sxx_floatpin);
    memcpy(&s_stm32i2c_generics.i2c_gpio_sda.pin, pin, sizeof(GPIO_InitTypeDef));
    s_stm32i2c_generics.i2c_gpio_sda.pin.GPIO_Pin = s_stm32i2c_i2c_gpio_thepins[s_stm32i2c_generics.cfg.sda.pin];

  
    return(stm32i2c_res_OK);
}

static stm32i2c_result_t s_stm32i2c_i2c_common_init(const stm32i2c_cfg_t* i2ccfg)
{
    const uint8_t usefloatingpins = 0;
    if(stm32i2c_res_NOK == s_stm32i2c_i2c_prepare_data(i2ccfg, usefloatingpins))
    {
        return(stm32i2c_res_NOK);
    }
    
    s_stm32i2c_i2c_gpio_init();
    s_stm32i2c_i2c_enable();
    
    return(stm32i2c_res_OK);
}


static stm32i2c_result_t s_stm32i2c_i2c_common_deinit(const stm32i2c_cfg_t* i2ccfg)
{

    const uint8_t usefloatingpins = 1;
    if(stm32i2c_res_NOK == s_stm32i2c_i2c_prepare_data(i2ccfg, usefloatingpins))
    {
        return(stm32i2c_res_NOK);
    }
    s_stm32i2c_i2c_disable();
    s_stm32i2c_i2c_gpio_deinit();
    
    return(stm32i2c_res_OK);
}



static void s_stm32i2c_i2c_gpio_init(void)
{   
#if     defined(USE_STM32F1)
    
    // i2c periph clock enable
    RCC_APB1PeriphClockCmd(s_stm32i2c_generics.i2cx_cfg.clock, ENABLE);
    
    // sda and scl periph clock enable
    RCC_APB2PeriphClockCmd(s_stm32i2c_generics.i2c_gpio_scl.clock | s_stm32i2c_generics.i2c_gpio_sda.clock, ENABLE);

    // afio periph clock enable
    RCC_APB2PeriphClockCmd(s_stm32i2c_generics.i2cx_cfg.gpio_remap_clock, ENABLE);
    
    // reset i2c input
    RCC_APB1PeriphResetCmd(s_stm32i2c_generics.i2cx_cfg.clock, ENABLE);
  
    // release reset signal for i2c input
    RCC_APB1PeriphResetCmd(s_stm32i2c_generics.i2cx_cfg.clock, DISABLE);
    
    // i2c remapping   
    GPIO_PinRemapConfig(s_stm32i2c_generics.i2cx_cfg.gpio_remap, ENABLE);    
        
