robotology/icub-firmware/emBODY/arch-armcmx/body/abslayer/hal-package/hal/hal-src/stm32fx/utils/stm32i2c.c
    // configure gpio for scl
    GPIO_Init((GPIO_TypeDef*)s_stm32i2c_generics.i2c_gpio_scl.port, (GPIO_InitTypeDef*)&s_stm32i2c_generics.i2c_gpio_scl.pin);
    
    // configure gpio for sda
    GPIO_Init((GPIO_TypeDef*)s_stm32i2c_generics.i2c_gpio_sda.port, (GPIO_InitTypeDef*)&s_stm32i2c_generics.i2c_gpio_sda.pin);    
    
#elif   defined(USE_STM32F4)    

    // i2c periph clock enable
    RCC_APB1PeriphClockCmd(s_stm32i2c_generics.i2cx_cfg.clock, ENABLE);
    
    // sda and scl periph clock enable
    RCC_AHB1PeriphClockCmd(s_stm32i2c_generics.i2c_gpio_scl.clock | s_stm32i2c_generics.i2c_gpio_sda.clock, ENABLE);

    // afio periph clock enable
    RCC_APB2PeriphClockCmd(s_stm32i2c_generics.i2cx_cfg.gpio_remap_clock, ENABLE);
    
    // reset i2c input
    RCC_APB1PeriphResetCmd(s_stm32i2c_generics.i2cx_cfg.clock, ENABLE);
  
    // release reset signal for i2c input
    RCC_APB1PeriphResetCmd(s_stm32i2c_generics.i2cx_cfg.clock, DISABLE);
    
    // i2c remapping     
    GPIO_PinAFConfig((GPIO_TypeDef*)s_stm32i2c_generics.i2c_gpio_scl.port, s_stm32i2c_generics.i2c_gpio_scl.pinnum, s_stm32i2c_generics.i2cx_cfg.gpio_remap);
    GPIO_PinAFConfig((GPIO_TypeDef*)s_stm32i2c_generics.i2c_gpio_sda.port, s_stm32i2c_generics.i2c_gpio_sda.pinnum, s_stm32i2c_generics.i2cx_cfg.gpio_remap); 
        
    // configure gpio for scl
    GPIO_Init((GPIO_TypeDef*)s_stm32i2c_generics.i2c_gpio_scl.port, (GPIO_InitTypeDef*)&s_stm32i2c_generics.i2c_gpio_scl.pin);
    
    // configure gpio for sda
    GPIO_Init((GPIO_TypeDef*)s_stm32i2c_generics.i2c_gpio_sda.port, (GPIO_InitTypeDef*)&s_stm32i2c_generics.i2c_gpio_sda.pin);    
    
#endif

}

static void s_stm32i2c_i2c_enable(void)
{
#if     defined(USE_STM32F1) || defined(USE_STM32F4)  

    I2C_InitTypeDef i2c_cfg;
    memcpy(&i2c_cfg, &s_stm32i2c_i2c_cfg, sizeof(I2C_InitTypeDef));
    // apply the clockspeed 
    i2c_cfg.I2C_ClockSpeed = s_stm32i2c_generics.cfg.speed;
    // i2c peripheral enable
    I2C_Cmd(s_stm32i2c_generics.i2cx, ENABLE);
    // apply configuration
    I2C_Init(s_stm32i2c_generics.i2cx, &i2c_cfg);
     
#endif
}



static void s_stm32i2c_i2c_disable(void)
{   
#if     defined(USE_STM32F1) || defined(USE_STM32F4)    

    // i2c disable
    I2C_Cmd(s_stm32i2c_generics.i2cx, DISABLE);
 
    // i2c deinit
    I2C_DeInit(s_stm32i2c_generics.i2cx);

    // i2c clock disable
    RCC_APB1PeriphClockCmd(s_stm32i2c_generics.i2cx_cfg.clock, DISABLE);

#endif    
}

static void s_stm32i2c_i2c_gpio_deinit(void)
{ 
#if     defined(USE_STM32F1) || defined(USE_STM32F4)
    // configure scl and sda as floating pin using values filled beforehands in i2c_gpio_scl and i2c_gpio_sda
    GPIO_Init((GPIO_TypeDef*)s_stm32i2c_generics.i2c_gpio_scl.port, (GPIO_InitTypeDef*)&s_stm32i2c_generics.i2c_gpio_scl.pin);
    GPIO_Init((GPIO_TypeDef*)s_stm32i2c_generics.i2c_gpio_sda.port, (GPIO_InitTypeDef*)&s_stm32i2c_generics.i2c_gpio_sda.pin); 
#endif    
}





//#endif//HAL_USE_I2C4HAL

// --------------------------------------------------------------------------------------------------------------------
// - end-of-file (leave a blank line after)
// --------------------------------------------------------------------------------------------------------------------



